app/views/carts/_cart.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 6]]
SELECT  1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT ?  [["cart_id", 11], ["LIMIT", 1]]
---
<% unless cart.line_items.empty? %>