app/controllers/carts_controller.rb

DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 2]]
---
  def destroy
    @cart.destroy if @cart.id == session[:cart_id]