app/controllers/products_controller.rb

INSERT INTO "products" ("title", "description", "image_url", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "dsadawa"], ["description", "dasdawdas"], ["image_url", "tripleh.jpg"], ["price", 10000.0], ["created_at", "2018-05-23 11:04:19.302399"], ["updated_at", "2018-05-23 11:04:19.302399"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "title" = ?, "description" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title", "giày đá banh"], ["description", "giày đá banh"], ["price", 1000000.0], ["updated_at", "2018-05-24 03:38:49.346189"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)